In [ ]:
%%!
pip install --trusted-host pypi.org ipython-sql

In [4]:
%load_ext sql

The sql extension is already loaded. To reload it, use:
  %reload_ext sql

In [5]:
%sql sqlite://

'Connected: @None'

In [6]:
import sqlite3
import pandas as pd

In [29]:
 df1 = pd.read_csv("/Users/apple/Desktop/takehomechallenges/sql/query_four/query_four_april.csv")
df2=pd.read_csv("/Users/apple/Desktop/takehomechallenges/sql/query_four/query_four_march.csv")

In [68]:
conn = sqlite3.connect("query_one.db")

In [ ]:
 df1.to_sql("four",conn)
df2.to_sql("three",conn)

In [ ]:
sql_string ='''
select user_id, sum(transaction_amount)
from (select * from three union all select * from four)
group by user_id
limit 10
'''

In [77]:
df = pd.read_sql(sql_string,conn)

In [78]:
df

   user_id  sum(transaction_amount)
0        2                       67
1        3                       26
2        4                      156
3        5                       45
4        6                       32
5        8                      235
6        9                      159
7       10                       15
8       11                      162
9       12                      129

In [95]:
sql_string ='''
with w1 as(
select user_id, sum(transaction_amount) as total,date
from (select * from three union all select * from four)
group by user_id,date
limit 10
)
select user_id,date, 
sum(total) over(partition by user_id order by date) as running_total
from w1
limit 10

'''

In [96]:
df = pd.read_sql(sql_string,conn)

In [97]:
df

   user_id        date  running_total
0        2  2015-03-13             67
1        3  2015-03-31             26
2        4  2015-03-28             63
3        4  2015-04-20            156
4        5  2015-03-01             45
5        6  2015-03-15             32
6        8  2015-03-06             66
7        8  2015-03-14            139
8        8  2015-04-07            235
9        9  2015-04-17             89